"""
 "" Задача №1
cars = int(input('Скольк км в дeнь прoедит машина ?_'))
dis = int(input('Сколько надо проехать км ?_'))
res = (cars + dis - 1) // cars
print(f"{res}  дня в пути")
"""

""" Задача №2
pup1 = int(input('Сколько учеников в первом классе_'))
pup2 = int(input('Сколько учеников во втором классе_'))
pup3 = int(input('Сколько учеников в третьем классе_'))
res = (pup1 + pup2 + pup3 + 1) // 2
print(f"{res}  парт надо")
"""